sweet
nations
video
.
just
in
time
for
christmas
*
url
usr
we
are
to
have
talked
...
and
the
asked
about
ed
that's
hardly
nothing
;)
hey
there
!
nice
see
you
/
winter
weather
3
left
i'm
dying
over
here
"
i
can't
breathe
was
as
most
quote
of
year
an
list
released
by
a
university
you're
never
too
old
makes
me
then
getting
on
highway
seeing
break
lights
light
up
like
tree
..
my
first
beer
now
gonna
be
long
night
day
do
think
would
support
guy
who
out
your
daughter
?
doesn't
deserve
not
allowed
open
that
until
oh
,
thank
god
-
our
entire
office
email
system
is
down
big
event
santa
know
what
get
xmas
but
instead
through
facebook
instagram
twitter
hours
end
:p
outing_face
:
no
he
bloody
isn't
upstairs
changed
cold
or
both
with
pink
(
)
understand
difference
&
its
great
when
mobile
bill
text
realize
interested
|
sports
media
than
all
us
where
else
can
quality
insight
offered
guess
cat
also
lost
she
went
after
i've
been
feeding
her
few
times
#food
brilliant
trade
trying
find
battery
died
how
found
yes
please
need
second
hand
so
phone
cared
bc
could
sense
tho
this
girl
got
it
hit
books
thx
r
love
these
mornings
grimacing_face
best
feeling
amazingly
they
going
some
decent
money
wish
told
herself
heavy_black_heart
️
rain
has
made
extra
lazy
smiling_face_with_open_mouth_and_cold_sweat
doing
weekend
'
s
birthday
might
show
background
check
you'd
catch
right
self
protection
smh
something
%
whole
life
learned
new
wonderful
starting
work
at
feel
waiting
lol
grinning_face_with_smiling_eyes
will
let
kids
morning
thanks
guys
sure
happy
lester
trust
sucks
#was
#on
pm
#says
sydney
–
took
17
—
sec
limit
social
seriously
had
call
them
gone
yay
another
4am
physical
8
am
want
friday
omg
didn't
tell
town
face_screaming_in_fear
thought
real
fine
wait
fixed
^
o
hahahaha
#hypocrisy
calls
russell
brand
moment
much
stuff
m
sleepy
white_smiling_face
sell
way
=
goal
season
1
vs
really
fish
it's
safe
bet
won't
fit
crime
impossible
late
if
start
dress
already
running
car
<
decided
become
own
boss
more
free
whatsoever
loyalty
american
playing
super
missing
don't
#
among
100
cos
world
#net
positive
none
lives
come
people
funny
shit
better
shut
stupid
mouth
because
im
concerned
men
why
does
tongue
try
touch
high
speed
dentist
put
govt
paid
job
buy
online
pay
lot
steal
kevin
his
once
yr
little
reach
smile
reaction
whatever
happened
did
ever
make
sexy
hell
slow
quarter
design
guard
shouldn't
such
thing
sad
things
awesome
future
looks
from
started
losing
friends
flushed_face
::
hundred_points_symbol
hmmm
customer
hope
still
wanna
tweeted
part
2
20
2015
ambulance
service
important
finals
week
fucking
name
act
share
probably
cause
alcohol
filled
literally
cried
woke
store
ready
w
three
one
holes
watching
earlier
#christmas
making
@
says
being
living
same
dude
gift
guide
via
lunch
sleeping_face
#work
#business
said
hard
take
lmao
2014
fast
enough
dead
even
idea
describe
race
police
wear
color
good
wouldn't
apparently
group
thinks
kidding
face
tuned
u
talk
today
tweeting
joke
saw
turkey
here's
say
early
last
course
retweet
though
d
fun
loveee
short
having
go
under
feet
waking
saturday
bed
ruled
followed
rt
clearly
talent
kind
amazing
him
progress
thursday
weary_face
gym
date
tomorrow
sony
pulled
movie
we're
scared
country
keep
6
hour
nap
chinese
set
watch
added
water
dinner
bears
worst
football
pissed
off
airport
ruined
many
boys
expressionless_face
frozen
write
paper
picture
busy
answering
question
multiple_musical_notes
taking
rainy
dark
reading
obama
#obama
tired
man
small
choose
words
someone
response
customers
smiling_face_with_open_mouth
2nd
december
tonight
b
apartment
showed
mom
goes
haha
comes
back
america
#women
#over
appointment
drinks
treat
provide
ask
liberal
iraq
won
war
sick
other
tweets
yeah
sex
working
double
sleep
let's
those
news
nights
pure
#diy
change
every
enjoy
woohoo
years
seems
music
doctor
means
#ferguson
respect
public
achieved
needed
#fashion
delays
4
snow
yet
miss
days
close
city
99
performance
surprise
supportive
may
admit
period
post
personal
gets
butt
press
conference
cut
#what
#to
#me
#is
#gym
#the
#out
listening
their
lady
mad
face_with_tears_of_joy
hate
jessica
erson_raising_both_hands_in_celebration
bought
giant
tv
play
box
fuck
hall
message
well
wow
sorry
grandpa
use
liked
only
illegal
12
fake
guns
called
ahhh
7
missed
bit
hotel
owners
travel
airplane
done
again
fans
return
:)
sometimes
dont
anything
smiling_face_with_heart-shaped_eyes
face_throwing_a_kiss
ass
into
anymore
lucky
mean
stealing
husband
hat
tweet
history
clear
twice
different
results
loving
look
xd
saying
four
sounds
line
major
fantastic
photo
type
between
pain
#girl
#december
#love
maybe
kid
heard
cry
fingers
were
mary
he's
perfect
cray
secret
squad
ruin
people's
follow
you'll
article
daily
fail
£
flip
definition
yea
couple
schools
played
black
game
forget
join
#nyc
seen
actually
tried
remember
nephew
stopped
hair
drug
asks
y
away
answer
150
church
sign
without
speak-no-evil_monkey
word
mail
cops
killed
immediately
wrong
#follow
#jesus
tough
sun
#funny
loudly_crying_face
:|
14
hanging
women
fight
imagine
noon
fox
#nfl
talking
hack
using
bitch
argument
ppl
listen
stores
#tcot
smell
#notcies
#eu
juncker
million
forever
#our
#rip
anytime
cash
acceptable
used
nah
north
korean
private
thoughts
blowing
nose
pop
greatest
wednesday
today's
court
access
england
surely
review
awake
5
grinning_face
pistol
power
should
forward
while
presents
bad
occupy
white
completely
you've
mind
laughing
gotta
third
wheels
zero
place
train
finds
full
head
earn
posting
#lol
windows
classes
except
blame
everything
oil
goodness
worked
gas
sector
singing
along
english
sing
save
folks
glad
offer
#it
shows
fair
party
#and
dare
hungry
#good
#day
na
apart
true
tells
spell
correctly
far
itself
exciting
mine
ones
smiling_face_with_open_mouth_and_tightly-closed_eyes
father_christmas
rose
yesterday
#peshawarattack
top
tag
nation
ok
leg
front
baby
#we
#if
#keep
#never
#up
#success
shot
reason
staying
#monday
#ootd
#style
bless
shame
pakistan
:(
#torturereport
;
wasn't
aware
j
k
book
local
wtf
bye
bills
pretty
:/
lovely
:d
splashing_sweat_symbol
thumbs_down_sign
spot
leave
shoes
what's
rush
attached
50
fan
shoot
lack
#gamergate
porn
any
proof
coming
everyone
#annoying
family
attend
#he
before
putting
months
hot
chocolate
wi-fi
beach
parties
keyboard
see-no-evil_monkey
either
criminal
always
lose
two
officers
#icantbreathe
came
school
tired_face
face_with_medical_mask
bush
cia
methods
shocking
dropped
often
worry
society
young
parents
calling
bottle
i'll
teeth
mate
training
held
#2015
song
fire
safety
driving
cancel
heading
teachers
tests
semester
class
blood
mother
nature
give
yourself
written
gold
relationship
consists
experience
least
ur
xbox
live
network
due
$
officially
next
round
able
games
green
care
gear
monitor
etc
brown
ma
stay
single
absolutely
believe
n
suck
reply
around
union
express
pick
irony
cup
deserved
vote
moron
ball
square
bring
fucked
males
fool
thats
quite
interesting
number
read
abt
crossed
isnt
obvious
case
#rape
cannot
sentence
aw
merry
victory_hand
home
which
packers
japan's
#but
wanted
prime
hear
record
truly
son
#today
#for
#drawing
hockey
24
drive
speak
hurt
ourselves
#bbc
#news
photos
racism
democrats
must
control
divide
looking
kill
children
friend
reasons
given
ill
winking_face
cloud
#cool
face_with_no_good_gesture
information_desk_person
clever
ideas
lord
jesus
bbc
road
campaign
move
wrapping
confused_face
wrapped_present
page
#motivation
comic
submission
seat
wondering
ticket
meet
husbands
body
grant
who's
eating
table
happy_person_raising_one_hand
win
pictures
alert
>
#nowplaying
half
weight
ha
creepy
random
questions
stop
usa
relations
human
rights
cuba
#cuba
father
#old
+
voting
somebody
they're
players
very
math
final
excited
mood
#blessed
lips
street
grace
film
watched
#or
fix
ending
team
action
girls
…
bust
ensive_face
helping
tolerant
peaceful
faith
muslims
brothers
smirking_face
3:30
themselves
food
plan
www.monstermmorpg
com
since
#monstermmorpg
wearing
coat
coffee
fam
side
stats
lesson
mirror
wall
problem
___
carolina
beat
bay
winning
crap
drinking
healthy
exam
whoever
runs
account
fantasy
league
breaking
hindu
india
#kashmir
british
popular
earth
sarcastic
walk
style
blacks
#of
ordered
doubt
#truth
rest
wonder
transfer
jumping
room
likely
success
speaking
law
justice
#mtvstars
direction
terrible
sleeping
nicely
smiling_face_with_smiling_eyes
delivery
thumbs_up_sign
everyday
miles
favorite
army
#may
#be
deal
yup
educated
alot
story
protest
livelihood
activity
#sydneysiege
lads
london
against
sat
fat
ideology
totally
okay
putin
defending
government
help
myself
person
beauty
search
dad
report
stark
t
present
former
security
monday
there's
gunna
sit
less
we'll
plans
shooting
nigga
cute
mini
tour
#new
#life
clapping_hands_sign
giving
teacher
study
1am
cool
#quiksilvergoessupersonic
broke
heart
realized
haven't
weeks
episode
shop
skin
sort
wide
showing
ok_hand_sign
eve
10
ride
cant
cars
updates
five
minutes
update
#teenanalcasting
memory
ain't
worth
charge
huge
sums
favourite
walking
building
ya
explain
spice
gotten
available
how's
especially
special
h
staff
aaaand
er
violence
brave
soon
difficult
baseball
attack
original
large
tax
definitely
seemed
philly
south
strong
red
pants
em
matt
rodgers
holy
lyrics
#are
dream
grand
experts
korea
dallas
hello
flu
thinking
#flu
rich
price
anyway
#cute
eskom
pic
evidence
needs
prayers
charged
1/2
#fail
state
rock
~
shopping
helpful
loves
others
selfish
21
classy
january
website
randomly
multiple
unamused_face
drunk
signs
#twitter
#sorry
#so
#just
#say
lies
voice
sooo
feels
clean
block
ugh
legend
enter
#lbloggers
|:
patrick
comedy
awards
face_with_stuck-out_tongue_and_winking_eye
#how
#best
whether
19
world's
#this
#you
#can
issue
loved
confounded_face
buddy
bro
happen
gave
adorable
skills
ignorance
c
ignorant
#idiot
pics
millions
#proud
pass
breakfast
donuts
stomach
upset
boots
pairs
smiling_face_with_open_mouth_and_smiling_eyes
journalism
science
rangers
sitting
#enough
sparkles
engaged
kiss_mark
dancer
#im
x
knee
stand
france
#shocker
#uber
#finalsweek
mess
y'all
40
expected
apple
tbh
mostly
i'd
telling
blog
ashamed
#followme
seem
wake
heaven
countries
actor
tom
wisdom
ummm
umbrella_with_rain_drops
irrelevant
indian
failed
works
idk
western
alright
fall
asleep
youre
finally
movies
30
indeed
size
hahaha
roll
successful
essay
knock
#funtimes
computer
turn
#bad
sources
dating
9
ago
e
gifts
possible
emergency
member
hold
legendary
standing
#traffic
traffic
spending
jobs
effect
younger
#russia
facing
weird
punch
gee
#music
bout
picked
7:30
bae
kick
joy
freezing
ways
victoria
order
selfie
middle
house
climate
effort
happens
clothes
breaks
decide
together
gives
penguins
kiss
french
ignored
victims
business
link
relevant
sjws
fries
sends
eu
leaving
aww
poor
florida
handle
#blacklivesmatter
friendly
parking
opposite
speech
judge
wrote
meaning
erson_with_folded_hands
hands
9am
crowd
mass
babysitting
dry
fr
company
loud
during
quiet
perfectly
mum
beginning
cleaning
death
damn
ahead
eat
drink
scream
animals
hide
students
test
officer
#orionlaunch
visit
rn
15
min
1000
accept
ground
defense
david
above
average
based
plus
cancelled
afternoon
area
surprised
blocked
tea
members
_
loss
types
couldn't
point
pieces
employee
eye
banter
shocked
bucks
honestly
bar
crying
#insomnia
waste
mccain
helps
mondays
crazy
yo
mode
replace
player
nobody
lets
playoff
#kids
#happy
simply
count
obviously
fact
luck
baylor
john
#money
babies
f
trip
tuesday
holiday
#advancedwarfare
corporate
urple_heart
exactly
horrible
considering
youtube
channel
congrats
boy
sneezing
level
keeping
matter
student
fisted_hand_sign
pregnant
wine
site
easy
lots
grown
af
films
golf
term
display
woman
child
run
she's
stuck
ohhh
#fun
services
prob
adults
cats
tiger
aren't
humans
entertainment
that'll
studio
bird
#gharwapsi
eyes
beautiful
appreciate
silence
bruh
crack
mark
each
we've
audio
wants
bus
unless
:-)
college
package
yep
#israel
soul
hot_beverage
;p
agree
germs
window
hasn't
diagnosed
disorder
humanity
committee
tears
finnish
homework
caught
#like
usual
ersevering_face
smiling_face_with_sunglasses
chat
xx
11
yrs
feed
plate
anyone
spanish
past
☆
sunday
sleeping_symbol
overrated
supposed
usually
#shopping
8:
#australia
australia
skate
mountain
studied
#ha
false
door
ooh
smart
taylor
note
rather
rape
heavy
hi
professor
amen
dogs
hang
backs
peace
intelligence
;-)
jk
internet
wet
studying
taken
potential
<3
minute
assume
female
leeds
correct
towards
suffering
16
:-p
#loveit
duty
interview
row
#fb
learn
#do
flight
christmas_tree
snap
drop
conversation
everywhere
everyone's
congratulations
#by
currently
worse
boyfriend
re
passing
vodka
source
servers
religion
christians
fav
virgin
]
blue
bigger
bag
nope
foreign
session
later
teams
solid
draw
basically
believed
facts
listened
accounts
cuz
ends
begin
movement
turned
sound
official
knows
#sorrynotsorry
month
sale
album
cycle
hospital
face_with_look_of_triumph
burger
king
enjoyed
#beautiful
hashtag
behind
marketing
writing
boxing
heads
happening
laws
dip
matters
board
weary_cat_face
bringing
normal
manager
jump
land
prize
advice
socks
procrastinating
cramming
annoying
#your
biggest
#my
t-shirt
view
alone
outside
click
button
sweater
dance
wins
records
dressing
quiz
per
kinda
artist
#art
yellow
opinion
#its
#all
keeps
google
#happyholidays
2am
ugly
spend
issues
cough
shared
moon
current
information
#socialmedia
bias
hr
figure
finger
accidentally
hearing
problems
where's
everybody
strange
die
throwing
winner
almost
arguing
senate
falling
political
#taliban
received
face_savouring_delicious_food
bitches
#crafts
straight
℃
code
#tsu
knowing
points
3rd
location
result
#saintsfc
stories
welcome
invoice
insurance
#thanksobama
ignoring
forgot
coin
torture
grow
broken
ridiculous
buses
pouting_face
brother
send
bench
brought
blessed
produce
creative
practice
summer
cheers
terrorists
chance
passes
#no
flexed_biceps
section
steve
minds
chris
driver
#ericgarner
challenge
copyright
reality
200
west
#look
person_raising_both_hands_in_celebration
chicken
stairs
continue
followers
phil
#notcias
#europ
comfortable
ability
[
afford
v
tony
decision
industry
sent
statement
#why
weekends
credit
card
. .
boo
arty_popper
longer
gay
notice
blast
answers
simple
crew
americans
#chicago
qb
till
two_hearts
truth
apps
planet
#entrepreneur
dear
health
uni
face_with_stuck-out_tongue_and_tightly-closed_eyes
skull
earned
club
series
memphis
#photo
metro
#one
position
green_heart
bath
crying_face
loose
jack
mix
aka
grandma
#year
5th
freedom
#struggle
13
following
focus
bowler
prefer
library
cr
makeup
someone's
patriots
deny
committed
field
dislike
year's
religious
#wow
#fml
#ugh
stressed
#dead
grumpy
easier
rise
#christians
smartphone
app
pays
sky
#hypocrites
yours
rob
step
calendar
checked
protesting
#wtf
cover
common
incredible
flat
pizza
male
lie
#nypd
#smh
35
dc
sisters
lecoincanard
knitting
pdp
slams
restaurant
#long
#time
knowledge
#sonyhack
add
honest
#police
l
hopefully
holidays
buzzing
#frozen
supports
passed
meal
killing
500
info
sarcasm
awful
confusing
bomb
supporting
racist
salad
fails
tropical_drink
iphone
council
ten
goals
#in
himself
tickets
puppy
china
pair
fabulous
sox
disappointed_face
moving
powerful
commercial
wishing
groups
profile
score
stress
representation
. ...
murder
paradise
la
crisis
snowflake
push
trouble
hoe
easily
sigh
barf
bank
proud
married
bowl
gooden
・
#sundayfunday
beats
hurts
takes
monkeys
ah
taste
latest
dog
#startup
#now
republican
neither
storm
purple_heart
liberals
flowers
development
